{
    "skills": [
      {
        "name": "Memory Processes",
        "shortDescription": "Storing and recalling information using keys, queries, or mnemonics.",
        "fullDescription": "Memory processes are part of the information that is processed and stored in an appropriate medium to be recovered at will according to some keys, queries, or mnemonics. This covers long-term memory and episodic memory, possibly using external devices such as books, spreadsheets, logs, databases, annotations, agendas, and any other kind of analogical or digital recording and retrieval of data."
      },
      {
        "name": "Sensorimotor Interaction",
        "shortDescription": "Interacting with the environment using sensory and motor capabilities.",
        "fullDescription": "Sensorimotor interaction deals with the perception of things, recognizing patterns in different ways and manipulating them in physical or virtual environments with parts of the body (limbs) or other physical or virtual actuators, not only through various sensory and actuator modalities but in terms of mixing representations."
      },
      {
        "name": "Visual Processing",
        "shortDescription": "Understanding visual information, including object and movement recognition.",
        "fullDescription": "Visual processing deals with the processing of visual information, recognizing objects and symbols in images and videos, movement and content in the image, with robustness to noise and different angles and transformations."
      },
      {
        "name": "Auditory Processing",
        "shortDescription": "Understanding auditory information, such as speech and music.",
        "fullDescription": "Auditory processing deals with the processing of auditory information, such as speech and music, in noise environments and at different frequencies."
      },
      {
        "name": "Attention and Search",
        "shortDescription": "Focusing attention and seeking relevant elements in information streams.",
        "fullDescription": "Attention and search deal with focusing attention on the relevant parts of a stream of information in any kind of modality, by ignoring irrelevant objects, parts, patterns, etc. Similarly, it is the ability to seek those elements that meet some criteria in the incoming information."
      },
      {
        "name": "Planning, Sequential Decision-Making and Acting",
        "shortDescription": "Anticipating action consequences and making informed decisions.",
        "fullDescription": "This deals with anticipating the consequences of actions, understanding causality, and calculating the best course of actions given a situation."
      },
      {
        "name": "Comprehension and Expression",
        "shortDescription": "Understanding and generating natural language and ideas.",
        "fullDescription": "This deals with understanding natural language, other kinds of semantic representations in different modalities, extracting or summarizing their meaning, as well as generating and expressing ideas, stories, and positions."
      },
      {
        "name": "Communication",
        "shortDescription": "Exchanging information effectively through various channels.",
        "fullDescription": "This deals with exchanging information with peers, understanding what the content of the message must be in order to obtain a given effect, following different protocols and channels of informal and formal communication."
      },
      {
        "name": "Emotion and Self-Control",
        "shortDescription": "Managing emotions and impulses in various situations.",
        "fullDescription": "This deals with understanding the emotions of other agents, how they affect their behaviour and also recognizing one's own emotions and controlling them and other basic impulses depending on the situation."
      },
      {
        "name": "Navigation",
        "shortDescription": "Moving through environments safely and efficiently.",
        "fullDescription": "This deals with being able to move objects or oneself between different positions, through appropriate, safe routes and in the presence of other objects or agents, and changes in the routes."
      },
      {
        "name": "Conceptualisation, Learning and Abstraction",
        "shortDescription": "Generalizing from examples and accumulating knowledge.",
        "fullDescription": "This deals with being able to generalize from examples, receive instructions, learn from demonstrations, and accumulate knowledge at different levels of abstraction."
      },
      {
        "name": "Quantitative and Logical Reasoning",
        "shortDescription": "Engaging with and inferring from quantitative or logical information.",
        "fullDescription": "This deals with the representation of quantitative or logical information that is intrinsic to the task, and the inference of new information from them that solves the task, including probabilities, counterfactuals, and other kinds of analytical reasoning."
      },
      {
        "name": "Mind Modelling and Social Interaction",
        "shortDescription": "Understanding and anticipating others' beliefs, desires, and actions.",
        "fullDescription": "This deals with the creation of models of other agents, so that their beliefs, desires, and intentions can be understood, and anticipate the actions and interests of other agents."
      },
      {
        "name": "Metacognition and Confidence Assessment",
        "shortDescription": "Evaluating one's own capabilities and decision-making confidence.",
        "fullDescription": "This deals with the evaluation of one's own capabilities, reliability, and limitations, self-assessing the probability of success, the effort, and risks of one's own actions."
      }
    ]
  }
  